# FPatByClass

## Description
Sets the default document fill pattern to the fill pattern of the active class.&lt;BR&gt;

```pascal
PROCEDURE FPatByClass;
```

```python

def vs.FPatByClass():
    return None
```

## Remarks
Sets the global attributes to use the fill pattern of the default class.<BR>
[sd 8/19/98]

## See Also
VS Functions:
PenColorByClass| MarkerByClass| FillColorByClass

## Version
Availability: from VectorWorks8.0
## Category
* Classes